src/InformationRegisters/ОчередьОбменаМаркировки/ОчередьОбменаМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбменаМаркировки</name>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииОчередиМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДокументЗаказКодов</name>
    <type>
      <types>DocumentRef.ЗаказКодовМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаписиОчередиМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>СчетчикПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЛогОбращенийAPIМаркировки/ЛогОбращенийAPIМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогОбращенийAPIМаркировки</name>
  <resources>
    <name>МоментВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииОчередиМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>Страна</name>
    <type>
      <types>EnumRef.Страны</types>
    </type>
  </resources>
  <resources>
    <name>Узел</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодОтветаHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелоОтветаБинарный</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗаписиОчереди</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусЗаписиОчередиМаркировки/СтатусЗаписиОчередиМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаписиОчередиМаркировки</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ТребуетРазбора</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипОперацииОчередиМаркировки/ТипОперацииОчередиМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОперацииОчередиМаркировки</name>
  <enumValues>
    <name>ЗаказКодов</name>
  </enumValues>
  <enumValues>
    <name>ОтчетНанесения</name>
  </enumValues>
  <enumValues>
    <name>ОтчетАгрегации</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеСправочников</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаказКодовМаркировки/ЗаказКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКодовМаркировки</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.СтатусВыполненияЗаказаКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Коды</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКодов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеКодовМаркировки/ПоступлениеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКодовМаркировки</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ОператорыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКодов</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветAPIБинарный</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Коды</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеВОтвете</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ОператорыМаркировки/ОператорыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОператорыМаркировки</name>
  <attributes>
    <name>Страна</name>
    <type>
      <types>EnumRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкружениеОператораМаркировки</name>
    <type>
      <types>EnumRef.ОкружениеОператораМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючAPI</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОчередьОбменаМаркировкиСервер/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Добавляет запись в очередь обмена маркировки.
// Страна определяется по ДокументЗаказКодов.Заказ.Контрагент.Страна.
//
// Параметры:
//  ТипОперации - ПеречислениеСсылка.ТипОперацииОчередиМаркировки - тип операции (ЗаказКодов, ОтчетНанесения и т.д.)
//  ТелоЗапроса - Строка - тело HTTP-запроса (JSON)
//  ДокументЗаказКодов - ДокументСсылка.ЗаказКодовМаркировки
//
// Возвращаемое значение:
//  УникальныйИдентификатор - идентификатор созданной записи очереди
//
Функция ДобавитьВОчередь(ТипОперации, ТелоЗапроса, ДокументЗаказКодов = Неопределено) Экспорт
	Идентификатор = Новый УникальныйИдентификатор;

	МенеджерЗаписи = РегистрыСведений.ОчередьОбменаМаркировки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.ТипОперации = ТипОперации;
	МенеджерЗаписи.ТелоЗапроса = ПоместитьВХранилище(ТелоЗапроса);
	МенеджерЗаписи.ДокументЗаказКодов = ДокументЗаказКодов;
	МенеджерЗаписи.Статус = Перечисления.СтатусЗаписиОчередиМаркировки.КВыполнению;
	МенеджерЗаписи.СчетчикПовторов = 0;
	МенеджерЗаписи.ДатаСледующейПопытки = ТекущаяДатаСеанса();
	МенеджерЗаписи.ДатаСоздания = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();

	Возврат Идентификатор;
КонецФункции

// Обрабатывает очередь обмена: выбирает записи к выполнению, выполняет HTTP-запросы, обновляет статусы.
// При успехе для типа ЗаказКодов создаёт документ ПоступлениеКодовМаркировки.
// Модальный вопрос при ручном запуске проверяется на клиенте до вызова; при регламентном задании не показывается.
//
Процедура ОбработатьОчередь() Экспорт
	МаксимумПовторов = Константы.МаркировкаМаксимумПовторовОчереди.Получить();
	Если НЕ ЗначениеЗаполнено(МаксимумПовторов) ИЛИ МаксимумПовторов <= 0 Тогда
		МаксимумПовторов = 5;
	КонецЕсли;
	
	ИнтервалПовтораМинут = Константы.МаркировкаИнтервалПовтораОчередиМинут.Получить();
	Если НЕ ЗначениеЗаполнено(ИнтервалПовтораМинут) ИЛИ ИнтервалПовтораМинут <= 0 Тогда
		ИнтервалПовтораМинут = 5;
	КонецЕсли;

	ЗапросОчереди = Новый Запрос;
	ЗапросОчереди.Текст =
		"ВЫБРАТЬ
		|	ОчередьОбменаМаркировки.Идентификатор КАК Идентификатор,
		|	ОчередьОбменаМаркировки.ТипОперации КАК ТипОперации,
		|	ОчередьОбменаМаркировки.ТелоЗапроса КАК ТелоЗапроса,
		|	ОчередьОбменаМаркировки.ДокументЗаказКодов КАК ДокументЗаказКодов,
		|	ОчередьОбменаМаркировки.СчетчикПовторов КАК СчетчикПовторов,
		|	ЕСТЬNULL(ДокументЗаказКодов.Заказ.Контрагент.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК Страна
		|ИЗ
		|	РегистрСведений.ОчередьОбменаМаркировки КАК ОчередьОбменаМаркировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКодовМаркировки КАК ДокументЗаказКодов
		|		ПО ОчередьОбменаМаркировки.ДокументЗаказКодов = ДокументЗаказКодов.Ссылка
		|ГДЕ
		|	ОчередьОбменаМаркировки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаписиОчередиМаркировки.КВыполнению)
		|	И (ОчередьОбменаМаркировки.ДатаСледующейПопытки <= &ТекущаяДата
		|		ИЛИ НЕ ОчередьОбменаМаркировки.ДатаСледующейПопытки.ЗНАЧЕНИЕ ЗАПОЛНЕНО)";

	ЗапросОчереди.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	ВыборкаОчереди = ЗапросОчереди.Выполнить().Выбрать();

	ОператорыПоСтранам = Новый Соответствие;

	Пока ВыборкаОчереди.Следующий() Цикл
		ТекущаяСтрана = ВыборкаОчереди.Страна;
		Если ЗначениеЗаполнено(ТекущаяСтрана) И ОператорыПоСтранам.Получить(ТекущаяСтрана) = Неопределено Тогда
			ОператорыПоСтранам.Вставить(ТекущаяСтрана, ПолучитьОператораМаркировкиПоСтране(ТекущаяСтрана));
		КонецЕсли;
	КонецЦикла;

	ВыборкаОчереди.Сбросить();

	Пока ВыборкаОчереди.Следующий() Цикл
		Оператор = ОператорыПоСтранам.Получить(ВыборкаОчереди.Страна);
		ОбработатьЗаписьОчереди(ВыборкаОчереди.Идентификатор, ВыборкаОчереди.ТипОперации, ВыборкаОчереди.ТелоЗапроса,
			ВыборкаОчереди.ДокументЗаказКодов, ВыборкаОчереди.СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут, Оператор);
	КонецЦикла;
КонецПроцедуры

// Возвращает оператора маркировки по стране
//
// Параметры:
//  Страна - ПеречислениеСсылка.Страны - Страна
//
// Возвращаемое значение:
//  СправочникСсылка.ОператорыМаркировки - Оператор маркировки
//  - Неопределено - Если оператор не найден
//
Функция ПолучитьОператораМаркировкиПоСтране(Страна)Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОператорыМаркировки.Ссылка КАК ОператорМаркировки
		|ИЗ
		|	Справочник.ОператорыМаркировки КАК ОператорыМаркировки
		|ГДЕ
		|	ОператорыМаркировки.Страна = &Страна
		|	И ОператорыМаркировки.Активный = ИСТИНА";
	Запрос.УстановитьПараметр("Страна", Страна);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОператорМаркировки;
	КонецЕсли;
	Возврат Справочники.ОператорыМаркировки.ПустаяСсылка();
КонецФункции

// Устанавливает запись очереди на повторную попытку через указанный интервал.
//
// Параметры:
//  ИдентификаторЗаписи - УникальныйИдентификатор - идентификатор записи очереди
//  ИнтервалМинут - Число - интервал до следующей попытки в минутах
//
Процедура ПовторнаяПопытка(ИдентификаторЗаписи, ИнтервалМинут) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИнтервалМинут) ИЛИ ИнтервалМинут <= 0 Тогда
		ИнтервалМинут = Константы.МаркировкаИнтервалПовтораОчередиМинут.Получить();
		Если НЕ ЗначениеЗаполнено(ИнтервалМинут) ИЛИ ИнтервалМинут <= 0 Тогда
			ИнтервалМинут = 5;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ОчередьОбменаМаркировки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = ИдентификаторЗаписи;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Статус = Перечисления.СтатусЗаписиОчередиМаркировки.КВыполнению;
		МенеджерЗаписи.СчетчикПовторов = МенеджерЗаписи.СчетчикПовторов + 1;
		МенеджерЗаписи.ДатаСледующейПопытки = ТекущаяДатаСеанса() + ИнтервалМинут * 60;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обрабатывает одну запись очереди: выполняет HTTP-запрос, логирует результат, обновляет статус записи. При успешной операции заказа кодов создает документ ПоступлениеКодовМаркировки.
//
// Параметры:
//   Идентификатор - УникальныйИдентификатор - идентификатор записи очереди
//   ТипОперации - ПеречислениеСсылка.ТипОперацииОчередиМаркировки - тип выполняемой операции
//   ТелоЗапроса - Строка, ХранилищеЗначения - тело HTTP-запроса
//   ДокументЗаказКодов - ДокументСсылка.ЗаказКодовМаркировки - документ, инициировавший операцию
//   СчетчикПовторов - Число - текущее количество повторных попыток
//   МаксимумПовторов - Число - максимально допустимое количество повторов
//   ИнтервалПовтораМинут - Число - интервал между повторными попытками в минутах
Процедура ОбработатьЗаписьОчереди(Идентификатор, ТипОперации, ТелоЗапроса, ДокументЗаказКодов, СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут)
	Страна = Неопределено;
	Если ЗначениеЗаполнено(ДокументЗаказКодов) Тогда
		ДокОбъект = ДокументЗаказКодов.ПолучитьОбъект();
		Если ДокОбъект <> Неопределено И ЗначениеЗаполнено(ДокОбъект.Заказ) Тогда
			ЗаказОбъект = ДокОбъект.Заказ.ПолучитьОбъект();
			Если ЗаказОбъект <> Неопределено И ЗначениеЗаполнено(ЗаказОбъект.Контрагент) Тогда
				КонтрагентОбъект = ЗаказОбъект.Контрагент.ПолучитьОбъект();
				Если КонтрагентОбъект <> Неопределено Тогда
					Страна = КонтрагентОбъект.Страна;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Страна) Тогда
		ОбновитьСтатусОчереди(Идентификатор, Перечисления.СтатусЗаписиОчередиМаркировки.Ошибка,
			"Не удалось определить страну по документу заказа кодов", СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут);
		Возврат;
	КонецЕсли;

	URL = НастройкиОбменаМаркировкиСервер.ПолучитьURLОператора(Страна);
	Если Не ЗначениеЗаполнено(URL) Тогда
		ОбновитьСтатусОчереди(Идентификатор, Перечисления.СтатусЗаписиОчередиМаркировки.Ошибка,
			"Не настроен URL оператора для страны " + Строка(Страна), СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут);
		Возврат;
	КонецЕсли;

	// TODO: добавить путь API по типу операции и стране (Этап 5). Пока — базовый URL.
	ПолныйURL = URL;
	КлючAPI = НастройкиОбменаМаркировкиСервер.ПолучитьКлючAPI(Страна);
	Таймаут = НастройкиОбменаМаркировкиСервер.ПолучитьТаймаутЗапросаСекунды(Страна);

	Заголовки = Новый Соответствие;
	Если ЗначениеЗаполнено(КлючAPI) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + КлючAPI);
	КонецЕсли;

	ТелоЗапросаСтрока = "";
	Если ТипЗнч(ТелоЗапроса) = Тип("ХранилищеЗначения") Тогда
		ТелоЗапросаСтрока = ИзвлечьИзХранилища(ТелоЗапроса);
	ИначеЕсли ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
		ТелоЗапросаСтрока = ТелоЗапроса;
	КонецЕсли;
	
	РезультатHTTP = HTTPКлиентМаркировкиСервер.ВыполнитьЗапрос(ПолныйURL, "POST", ТелоЗапросаСтрока, Заголовки, Таймаут);

	ЗаписатьВЛог(Идентификатор, ТипОперации, Страна, РезультатHTTP.Успешно, РезультатHTTP.КодОтветаHTTP,
		ТелоЗапросаСтрока, РезультатHTTP.ТелоОтветаБинарный, РезультатHTTP.ТекстОшибки);

	Если РезультатHTTP.Успешно Тогда
		ОбновитьСтатусОчереди(Идентификатор, Перечисления.СтатусЗаписиОчередиМаркировки.Выполнен, "", СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут);

		Если ТипОперации = Перечисления.ТипОперацииОчередиМаркировки.ЗаказКодов И ЗначениеЗаполнено(ДокументЗаказКодов) Тогда
			СоздатьПоступлениеКодов(ДокументЗаказКодов, Страна, РезультатHTTP.ТелоОтветаБинарный);
		КонецЕсли;
	Иначе
		ОбновитьСтатусОчереди(Идентификатор, Перечисления.СтатусЗаписиОчередиМаркировки.Ошибка,
			РезультатHTTP.ТекстОшибки, СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут);
	КонецЕсли;
КонецПроцедуры

// Обновляет статус записи очереди. При ошибке и не достигнутом лимите — ставит КВыполнению с отложенной датой; при лимите — ТребуетРазбора.
Процедура ОбновитьСтатусОчереди(Идентификатор, НовыйСтатус, ТекстОшибки, СчетчикПовторов, МаксимумПовторов, ИнтервалПовтораМинут)
	МенеджерЗаписи = РегистрыСведений.ОчередьОбменаМаркировки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Статус = НовыйСтатус;
		МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
		Если НовыйСтатус = Перечисления.СтатусЗаписиОчередиМаркировки.Ошибка Тогда
			МенеджерЗаписи.СчетчикПовторов = СчетчикПовторов + 1;
			Если МенеджерЗаписи.СчетчикПовторов >= МаксимумПовторов Тогда
				МенеджерЗаписи.Статус = Перечисления.СтатусЗаписиОчередиМаркировки.ТребуетРазбора;
			Иначе
				МенеджерЗаписи.Статус = Перечисления.СтатусЗаписиОчередиМаркировки.КВыполнению;
				МенеджерЗаписи.ДатаСледующейПопытки = ТекущаяДатаСеанса() + ИнтервалПовтораМинут * 60;

			КонецЕсли;
		КонецЕсли;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры

// Записывает обращение к API в регистр ЛогОбращенийAPIМаркировки.
Процедура ЗаписатьВЛог(ИдентификаторОчереди, ТипОперации, Страна, Успешно, КодОтветаHTTP, ТелоЗапроса, ТелоОтветаБинарный, ТекстОшибки)
	ИдентификаторЛога = Новый УникальныйИдентификатор;
	МенеджерЗаписи = РегистрыСведений.ЛогОбращенийAPIМаркировки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = ИдентификаторЛога;
	МенеджерЗаписи.МоментВремени = ТекущаяДатаСеанса();
	МенеджерЗаписи.ТипОперации = ТипОперации;
	МенеджерЗаписи.Страна = Страна;
	МенеджерЗаписи.Успешно = Успешно;
	МенеджерЗаписи.КодОтветаHTTP = КодОтветаHTTP;
	МенеджерЗаписи.ТелоЗапроса = ?(ЗначениеЗаполнено(ТелоЗапроса), ПоместитьВХранилище(ТелоЗапроса), Неопределено);
	МенеджерЗаписи.ТелоОтветаБинарный = ?(ТелоОтветаБинарный <> Неопределено, ПоместитьВХранилище(ТелоОтветаБинарный), Неопределено);
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	МенеджерЗаписи.ИдентификаторЗаписиОчереди = ИдентификаторОчереди;
	МенеджерЗаписи.Записать();
КонецПроцедуры

// Создает документ ПоступлениеКодовМаркировки по успешному ответу API.
//
// Параметры:
//   ДокументЗаказКодов - ДокументСсылка.ЗаказКодовМаркировки - документ заказа кодов
//   Страна - СправочникСсылка.КлассификаторСтранМира - страна получения кодов
//   ТелоОтветаБинарный - ДвоичныеДанные - бинарные данные ответа API

Процедура СоздатьПоступлениеКодов(ДокументЗаказКодов, Страна, ТелоОтветаБинарный)
	Оператор = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОператорыМаркировки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОператорыМаркировки КАК ОператорыМаркировки
		|ГДЕ
		|	ОператорыМаркировки.Страна = &Страна
		|	И ОператорыМаркировки.Активный = ИСТИНА";
	Запрос.УстановитьПараметр("Страна", Страна);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		//ППВ ???
		Оператор = Справочники.ОператорыМаркировки.ПустаяСсылка();
		//Оператор = Выборка.Ссылка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Оператор) Тогда
		Возврат;
	КонецЕсли;

	// TODO Этап 5: разбор ТелоОтветаБинарный по формату API, подсчёт кодов, заполнение ТЧ Коды
	КоличествоКодов = 0;

	НовыйДокумент = Документы.ПоступлениеКодовМаркировки.СоздатьДокумент();
	НовыйДокумент.Оператор = Оператор;
	НовыйДокумент.ЗаказКодов = ДокументЗаказКодов;
	НовыйДокумент.ОтветAPIБинарный = ПоместитьВХранилище(ТелоОтветаБинарный);
	НовыйДокумент.КоличествоКодов = КоличествоКодов;
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

// Помещает строку или двоичные данные в ХранилищеЗначения.
// Строка — UTF-8. ДвоичныеДанные — через Base64 (совместимость с разными версиями платформы).
Функция ПоместитьВХранилище(Значение)
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтрокаДляЗаписи = "";
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		СтрокаДляЗаписи = Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		СтрокаДляЗаписи = Base64Строка(Значение);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Хранилище = Новый ХранилищеЗначения;
	Поток = Хранилище.ОткрытьПотокДляЗаписи();
	ЗаписьТекста = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(СтрокаДляЗаписи);
	ЗаписьТекста.Закрыть();
	Хранилище.ЗакрытьПотокЗаписи(Поток);
	Возврат Хранилище;
КонецФункции

// Извлекает строку из ХранилищеЗначения (UTF-8).
Функция ИзвлечьИзХранилища(Хранилище)
	Если Хранилище = Неопределено Или Не ТипЗнч(Хранилище) = Тип("ХранилищеЗначения") Тогда
		Возврат "";
	КонецЕсли;
	Попытка
		Поток = Хранилище.ОткрытьПотокДляЧтения();
		ЧтениеТекста = Новый ЧтениеТекста(Поток, КодировкаТекста.UTF8);
		Результат = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
		Возврат Результат;
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции

#КонецОбласти
